GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021-08-20     BruceOu      first implementation
 */

#include "drv_usart.h"

#ifdef RT_USING_SERIAL

#ifndef USART_TRANSMIT_DMA_ENABLE
#define USART_TRANSMIT_DMA_ENABLE USART_DENT_ENABLE
#endif
#ifndef USART_TRANSMIT_DMA_DISABLE
#define USART_TRANSMIT_DMA_DISABLE USART_DENT_DISABLE
#endif
#ifndef USART_RECEIVE_DMA_ENABLE
#define USART_RECEIVE_DMA_ENABLE USART_DENR_ENABLE
#endif
#ifndef USART_RECEIVE_DMA_DISABLE
#define USART_RECEIVE_DMA_DISABLE USART_DENR_DISABLE
#endif

#if defined(SOC_SERIES_GD32H77x)
#define gd32_dma_deinit(periph, ch)                 dma_channel_deinit(periph, ch)
#else
#define gd32_dma_deinit(periph, ch)                 dma_deinit(periph, ch)
#endif

/* Compatibility macros: remap F30x/F10x/F20x DMA API to F4xx-style API signatures.
 * This allows driver code to use a single (F4xx-style) API set without #ifdef. */
#if defined(SOC_SERIES_GD32F30x)

/* DMA init struct: F30x dma_parameter_struct → F4xx dma_single_data_parameter_struct */
#define dma_single_data_parameter_struct            dma_parameter_struct
#define dma_single_data_para_struct_init(s)         dma_struct_para_init(s)
#define dma_single_data_mode_init(p, ch, s)         dma_init(p, ch, s)

/* Direction enums */
#define DMA_PERIPH_TO_MEMORY                        DMA_PERIPHERAL_TO_MEMORY
#define DMA_MEMORY_TO_PERIPH                        DMA_MEMORY_TO_PERIPHERAL

/* Data width enums: F4xx DMA_PERIPH_WIDTH → F30x DMA_PERIPHERAL_WIDTH */
#define DMA_PERIPH_WIDTH_8BIT                       DMA_PERIPHERAL_WIDTH_8BIT
#define DMA_PERIPH_WIDTH_16BIT                      DMA_PERIPHERAL_WIDTH_16BIT
#define DMA_PERIPH_WIDTH_32BIT                      DMA_PERIPHERAL_WIDTH_32BIT

/* DMA error flags: F30x has no FIFO/access error, map to generic DMA_FLAG_ERR */
#define DMA_FLAG_FEE                                DMA_FLAG_ERR
#define DMA_FLAG_TAE                                DMA_FLAG_ERR

/* DMA memory address config: F4xx 4-arg → F30x 3-arg (ignore memory index) */
#define dma_memory_address_config(p, ch, idx, addr) \
    dma_memory_address_config(p, ch, (uint32_t)(addr))

/* F30x struct field remapping via accessor macros */
#define GD32_DMA_SET_MEMADDR(s, v)              ((s)->memory_addr = (v))
/* F30x has separate periph_width (bits 8:9) / memory_width (bits 10:11).
 * CHCTL_MWIDTH(n) = CHCTL_PWIDTH(n) << 2, so shift converts between them. */
#define GD32_DMA_SET_DATAWIDTH(s, v)            do { (s)->periph_width = (v); \
                                                    (s)->memory_width = (v) << 2; } while(0)
/* F30x has no circular_mode field; use dma_circulation_disable() API instead */
#define GD32_DMA_SET_CIRCULAR(s, v)             ((void)0)

#else
/* F4xx/F5xx/H7xx: use native field names */
#define GD32_DMA_SET_MEMADDR(s, v)              ((s)->memory0_addr = (v))
#define GD32_DMA_SET_DATAWIDTH(s, v)            ((s)->periph_memory_width = (v))
#define GD32_DMA_SET_CIRCULAR(s, v)             ((s)->circular_mode = (v))

#endif /* F30x/F10x/F20x API remapping */

/* USART data register address macros for DMA configuration */
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
#define USART_DATA_TX(usartx) (&USART_TDATA(usartx))
#define USART_DATA_RX(usartx) (&USART_RDATA(usartx))
/* ARM Cortex-M7 cache line size for DMA buffer alignment */
#define RT_DMA_CACHE_LINE_SIZE  32
#else
#define USART_DATA_TX(usartx) (&USART_DATA(usartx))
#define USART_DATA_RX(usartx) (&USART_DATA(usartx))
#endif

#ifdef SOC_SERIES_GD32M53x
/* Map legacy USART names to UART for GD32M53x */
#define USART0                     UART0
#define USART1                     UART1
#define USART2                     UART2
#define USART3                     UART3
#define USART0_IRQn                UART0_IRQn
#define USART1_IRQn                UART1_IRQn
#define USART2_IRQn                UART2_IRQn
#define USART3_IRQn                UART3_IRQn
#define RCU_USART0                 RCU_UART0
#define RCU_USART1                 RCU_UART1
#define RCU_USART2                 RCU_UART2
#define RCU_USART3                 RCU_UART3

/* Map USART APIs to UART APIs */
#define usart_baudrate_set         uart_baudrate_set
#define usart_word_length_set      uart_word_length_set
#define usart_stop_bit_set         uart_stop_bit_set
#define usart_parity_config        uart_parity_config
#define usart_receive_config       uart_receive_config
#define usart_transmit_config      uart_transmit_config
#define usart_enable               uart_enable
#define usart_disable              uart_disable
#define usart_interrupt_enable     uart_interrupt_enable
#define usart_interrupt_disable    uart_interrupt_disable
#define usart_flag_get             uart_flag_get
#define usart_flag_clear           uart_flag_clear
#define usart_data_transmit        uart_data_transmit
#define usart_data_receive         uart_data_receive
#define usart_interrupt_flag_get   uart_interrupt_flag_get

/* Map USART enums to UART enums */
#define USART_WL_9BIT              UART_WL_9BIT
#define USART_WL_8BIT              UART_WL_8BIT
#define USART_STB_2BIT             UART_STB_2BIT
#define USART_STB_1BIT             UART_STB_1BIT
#define USART_PM_ODD               UART_PM_ODD
#define USART_PM_EVEN              UART_PM_EVEN
#define USART_PM_NONE              UART_PM_NONE
#define USART_RECEIVE_ENABLE       UART_RECEIVE_ENABLE
#define USART_TRANSMIT_ENABLE      UART_TRANSMIT_ENABLE
#define USART_INT_RBNE             UART_INT_RBNE
#define USART_INT_TC               UART_INT_TC
#define USART_FLAG_RBNE            UART_FLAG_RBNE
#define USART_FLAG_TBE             UART_FLAG_TBE
#define USART_FLAG_TC              UART_FLAG_TC
#define USART_FLAG_ORERR           UART_FLAG_ORERR
#define USART_INT_FLAG_RBNE        UART_INT_FLAG_RBNE
#define USART_INT_FLAG_TC          UART_INT_FLAG_TC
#endif /* SOC_SERIES_GD32M53x */

