GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
#if !defined(BSP_USING_UART0) && !defined(BSP_USING_UART1) && \
    !defined(BSP_USING_UART2) && !defined(BSP_USING_UART3) && \
    !defined(BSP_USING_UART4) && !defined(BSP_USING_UART5) && \
    !defined(BSP_USING_UART6) && !defined(BSP_USING_UART7)
#error "Please define at least one UARTx"

#endif

#include <rtdevice.h>

#ifdef RT_SERIAL_USING_DMA
static void gd32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag);
static void gd32_dma_tx_config(struct rt_serial_device *serial, rt_ubase_t flag);
static void dma_rx_done_isr(struct rt_serial_device *serial);

/* DMA TX threshold: transfers smaller than this use polling instead of DMA */
#ifdef BSP_UART_DMA_TX_THRESHOLD
#define GD32_DMA_TX_THRESHOLD   BSP_UART_DMA_TX_THRESHOLD
#else
#define GD32_DMA_TX_THRESHOLD   8
#endif
#endif /* RT_SERIAL_USING_DMA - forward declarations */

/* Polling TX timeout in milliseconds */
#ifdef BSP_UART_POLL_TX_TIMEOUT_MS
#define GD32_POLL_TX_TIMEOUT_MS BSP_UART_POLL_TX_TIMEOUT_MS
#else
#define GD32_POLL_TX_TIMEOUT_MS 1000
#endif

static void GD32_UART_IRQHandler(struct rt_serial_device *serial);

/*******************************************************************************
 * Serial device and DMA config declarations
 * (Moved before uart_obj to satisfy initialization dependencies)
 ******************************************************************************/
#if defined(BSP_USING_UART0)
struct rt_serial_device serial0;
#if defined(BSP_UART0_RX_USING_DMA)
static struct dma_config uart0_dma_rx_config = UART0_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART0_TX_USING_DMA)
static struct dma_config uart0_dma_tx_config = UART0_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART0 */

#if defined(BSP_USING_UART1)
struct rt_serial_device serial1;
#if defined(BSP_UART1_RX_USING_DMA)
struct dma_config uart1_rxdma = UART1_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART1_TX_USING_DMA)
struct dma_config uart1_txdma = UART1_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)
struct rt_serial_device serial2;
#if defined(BSP_UART2_RX_USING_DMA)
struct dma_config uart2_rxdma = UART2_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART2_TX_USING_DMA)
struct dma_config uart2_txdma = UART2_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)
struct rt_serial_device serial3;
#if defined(BSP_UART3_RX_USING_DMA)
struct dma_config uart3_rxdma = UART3_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART3_TX_USING_DMA)
struct dma_config uart3_txdma = UART3_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)
struct rt_serial_device serial4;
#if defined(BSP_UART4_RX_USING_DMA)
struct dma_config uart4_rxdma = UART4_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART4_TX_USING_DMA)
struct dma_config uart4_txdma = UART4_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART4 */

#if defined(BSP_USING_UART5)
struct rt_serial_device serial5;
#if defined(BSP_UART5_RX_USING_DMA)
struct dma_config uart5_rxdma = UART5_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART5_TX_USING_DMA)
struct dma_config uart5_txdma = UART5_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)
struct rt_serial_device serial6;
#if defined(BSP_UART6_RX_USING_DMA)
struct dma_config uart6_rxdma = UART6_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART6_TX_USING_DMA)
struct dma_config uart6_txdma = UART6_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)
struct rt_serial_device serial7;
#if defined(BSP_UART7_RX_USING_DMA)
struct dma_config uart7_rxdma = UART7_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART7_TX_USING_DMA)
struct dma_config uart7_txdma = UART7_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART7 */

/*******************************************************************************
 * uart_obj array definitions
 * (Moved before DMA helper functions for better code organization)
 ******************************************************************************/
#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E23x) && !defined(SOC_SERIES_GD32E11x) \
 && !defined(SOC_SERIES_GD32H77x) && !defined(SOC_SERIES_GD32M53x) && !defined(SOC_SERIES_GD32H7xx) \
 && !defined(SOC_SERIES_GD32F5xx) && !defined(SOC_SERIES_GD32F30x)
static const struct gd32_uart uart_obj[] = {
    #ifdef BSP_USING_UART0
    {
        USART0,                                /* uart peripheral index */
        USART0_IRQn,                           /* uart iqrn */
        RCU_USART0,                            /* uart periph clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32H7xx
        RCU_GPIOA, RCU_GPIOA,                  /* tx gpio clock, rx gpio clock */
        GPIOA, GPIO_AF_7, GPIO_PIN_9,          /* tx port, tx alternate, tx pin */
        GPIOA, GPIO_AF_7, GPIO_PIN_10,         /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOA, RCU_GPIOA,                  /* tx gpio clock, rx gpio clock */
        GPIOA, 0, GPIO_PIN_9,                  /* tx port, tx alternate, tx pin */
        GPIOA, 0, GPIO_PIN_10,                 /* rx port, rx alternate, rx pin */
        0,                                     /* afio remap cfg */
#elif defined SOC_SERIES_GD32E23x
        RCU_GPIOA, RCU_GPIOA,
        GPIOA, GPIO_AF_1, GPIO_PIN_9,
        GPIOA, GPIO_AF_1, GPIO_PIN_10,
#else
        RCU_GPIOA, RCU_GPIOA,                  /* tx gpio clock, rx gpio clock */
        GPIOA, GPIO_PIN_9,                     /* tx port, tx pin */
        GPIOA, GPIO_PIN_10,                    /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart0_rxdma,
#ifdef BSP_SERIAL_USING_TX_DMA
        &uart0_txdma,
#endif
#endif
        &serial0,
        "uart0",
    },
    #endif

    #ifdef BSP_USING_UART1
    {
        USART1,                                 /* uart peripheral index */
        USART1_IRQn,                            /* uart iqrn */
        RCU_USART1,                             /* uart periph clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx || defined SOC_SERIES_GD32F5xx
        RCU_GPIOA, RCU_GPIOA,                   /* tx gpio clock, rx gpio clock */
        GPIOA, GPIO_AF_7, GPIO_PIN_2,           /* tx port, tx alternate, tx pin */
        GPIOA, GPIO_AF_7, GPIO_PIN_3,           /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOA, RCU_GPIOA,                   /* tx gpio clock, rx gpio clock */
        GPIOA, 0, GPIO_PIN_2,                   /* tx port, tx alternate, tx pin */
        GPIOA, 0, GPIO_PIN_3,                   /* rx port, rx alternate, rx pin */
        0,                                      /* afio remap cfg */
#elif defined SOC_SERIES_GD32E23x
        RCU_GPIOA, RCU_GPIOA,
        GPIOA, GPIO_AF_1, GPIO_PIN_14,
        GPIOA, GPIO_AF_1, GPIO_PIN_15,
#else
        RCU_GPIOA, RCU_GPIOA,                   /* periph clock, tx gpio clock, rt gpio clock */
        GPIOA, GPIO_PIN_2,                      /* tx port, tx pin */
        GPIOA, GPIO_PIN_3,                      /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart1_rxdma,
#endif
        &serial1,
        "uart1",
    },
    #endif

