GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    #ifdef BSP_USING_UART2
    {
        USART2,                                 /* uart peripheral index */
        USART2_IRQn,                            /* uart iqrn */
        RCU_USART2,                                    /* uart periph clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx || defined SOC_SERIES_GD32F5xx
        RCU_GPIOB, RCU_GPIOB,                   /* tx gpio clock, rt gpio clock */
        GPIOB, GPIO_AF_7, GPIO_PIN_10,          /* tx port, tx alternate, tx pin */
        GPIOB, GPIO_AF_7, GPIO_PIN_11,          /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOB, RCU_GPIOB,                   /* tx gpio clock, rx gpio clock */
        GPIOB, 0, GPIO_PIN_10,                  /* tx port, tx alternate, tx pin */
        GPIOB, 0, GPIO_PIN_11,                  /* rx port, rx alternate, rx pin */
        0,                                      /* afio remap cfg */
#else
        RCU_GPIOB, RCU_GPIOB,                   /* tx gpio clock, rt gpio clock */
        GPIOB, GPIO_PIN_10,                     /* tx port, tx pin */
        GPIOB, GPIO_PIN_11,                     /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart2_rxdma,
#ifdef BSP_SERIAL_USING_TX_DMA
        &uart2_txdma,
#endif
#endif
        &serial2,
        "uart2",
    },
    #endif

    #ifdef BSP_USING_UART3
    {
        UART3,                                 /* uart peripheral index */
        UART3_IRQn,                            /* uart iqrn */
        RCU_UART3,                             /* uart periph clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32H7xx
        RCU_GPIOC, RCU_GPIOC,                  /* tx gpio clock, rt gpio clock */
        GPIOC, GPIO_AF_8, GPIO_PIN_10,         /* tx port, tx alternate, tx pin */
        GPIOC, GPIO_AF_8, GPIO_PIN_11,         /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        RCU_GPIOC, RCU_GPIOC,                   /* tx gpio clock, rx gpio clock */
        GPIOC, 0, GPIO_PIN_10,                  /* tx port, tx alternate, tx pin */
        GPIOC, 0, GPIO_PIN_11,                  /* rx port, rx alternate, rx pin */
        0,                                      /* afio remap cfg */
#else
        RCU_GPIOC, RCU_GPIOC,                  /* periph clock, tx gpio clock, rt gpio clock */
        GPIOC, GPIO_PIN_10,                    /* tx port, tx pin */
        GPIOC, GPIO_PIN_11,                    /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart3_rxdma,
#endif
        &serial3,
        "uart3",
    },
    #endif

    #ifdef BSP_USING_UART4
    {
        UART4,                                 /* uart peripheral index */
        UART4_IRQn,                            /* uart iqrn */
        RCU_UART4, RCU_GPIOC, RCU_GPIOD,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32H7xx
        GPIOC, GPIO_AF_8, GPIO_PIN_12,         /* tx port, tx alternate, tx pin */
        GPIOD, GPIO_AF_8, GPIO_PIN_2,          /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        GPIOC, 0, GPIO_PIN_12,                 /* tx port, tx alternate, tx pin */
        GPIOD, 0, GPIO_PIN_2,                  /* rx port, rx alternate, rx pin */
        0,                                     /* afio remap cfg */
#else
        GPIOC, GPIO_PIN_12,                    /* tx port, tx pin */
        GPIOD, GPIO_PIN_2,                     /* rx port, rx pin */
#endif
        &serial4,
        "uart4",
    },
    #endif

    #ifdef BSP_USING_UART5
    {
        USART5,                                 /* uart peripheral index */
        USART5_IRQn,                            /* uart iqrn */
        RCU_USART5, RCU_GPIOC, RCU_GPIOC,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOC, GPIO_AF_8, GPIO_PIN_6,           /* tx port, tx alternate, tx pin */
        GPIOC, GPIO_AF_8, GPIO_PIN_7,           /* rx port, rx alternate, rx pin */
#elif defined (SOC_SERIES_GD32H7xx)
        GPIOC, GPIO_AF_7, GPIO_PIN_6,           /* tx port, tx alternate, tx pin */
        GPIOC, GPIO_AF_7, GPIO_PIN_7,           /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E50x
        GPIOC, AFIO_PC6_USART5_CFG, GPIO_PIN_6, /* tx port, tx alternate, tx pin */
        GPIOC, AFIO_PC7_USART5_CFG, GPIO_PIN_7, /* rx port, rx alternate, rx pin */
        0,                                      /* afio remap cfg */
#else
        GPIOC, GPIO_PIN_6,                      /* tx port, tx pin */
        GPIOC, GPIO_PIN_7,                      /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart5_rxdma,
#ifdef BSP_SERIAL_USING_TX_DMA
        &uart5_txdma,
#endif
#endif
        &serial5,
        "uart5",
    },
    #endif

    #ifdef BSP_USING_UART6
    {
        UART6,                                 /* uart peripheral index */
        UART6_IRQn,                            /* uart iqrn */
        RCU_UART6, RCU_GPIOE, RCU_GPIOE,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOE, GPIO_AF_8, GPIO_PIN_7,          /* tx port, tx alternate, tx pin */
        GPIOE, GPIO_AF_8, GPIO_PIN_8,          /* rx port, rx alternate, rx pin */
#elif defined (SOC_SERIES_GD32H7xx)
        GPIOE, GPIO_AF_7, GPIO_PIN_8,          // tx port, tx alternate, tx pin
        GPIOE, GPIO_AF_7, GPIO_PIN_7,          // rx port, rx alternate, rx pin
#else
        GPIOE, GPIO_PIN_7,                     /* tx port, tx pin */
        GPIOE, GPIO_PIN_8,                     /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart6_rxdma,
#ifdef BSP_SERIAL_USING_TX_DMA
        &uart6_txdma,
#endif
#endif
        &serial6,
        "uart6",
    },
    #endif

    #ifdef BSP_USING_UART7
    {
        UART7,                                 /* uart peripheral index */
        UART7_IRQn,                            /* uart iqrn */
        RCU_UART7, RCU_GPIOE, RCU_GPIOE,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32H7xx
        GPIOE, GPIO_AF_8, GPIO_PIN_1,          /* tx port, tx alternate, tx pin */
        GPIOE, GPIO_AF_8, GPIO_PIN_0,          /* rx port, rx alternate, rx pin */
#else
        GPIOE, GPIO_PIN_0,                     /* tx port, tx pin */
        GPIOE, GPIO_PIN_1,                     /* rx port, rx pin */
#endif
#ifdef RT_SERIAL_USING_DMA
        &uart7_rxdma,
#ifdef BSP_SERIAL_USING_TX_DMA
        &uart7_txdma,
#endif
#endif
        &serial7,
        "uart7",
    },
    #endif
};

#else
static struct gd32_uart uart_obj[] = {
    #ifdef BSP_USING_UART0
    {
        USART0,                                /* uart peripheral index */
        RCU_USART0,                            /* uart periph clock */
        USART0_IRQn,                           /* uart iqrn */
        "uart0",
        &serial0,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART0_TX_USING_DMA
        &uart0_dma_tx_config,
#endif
#ifdef BSP_UART0_RX_USING_DMA
        &uart0_dma_rx_config,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART1
    {
        USART1,                                /* uart peripheral index */
        RCU_USART1,                            /* uart periph clock */
        USART1_IRQn,                           /* uart iqrn */
        "uart1",
        &serial1,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART1_TX_USING_DMA
        &uart1_txdma,
#endif
#ifdef BSP_UART1_RX_USING_DMA
        &uart1_rxdma,
#endif
#endif
    },
    #endif

